; domain
(define (domain blocks)
  (:requirements :strips :equality :disjunctive-preconditions :derived-predicates :negative-preconditions :conditional-effects :existential-preconditions :typing)

  (:types
    robot block - object
  )

  (:predicates 
    (on ?block1 - block ?block2 - block)
    (ontable ?block - block)
    (clear ?block - block)
    (KBquery_fullHands ?robot - robot)
    (holding ?robot - robot ?block - block)
  )

  (:action pick-up
    :parameters (?robot - robot ?block - block)
    :precondition (and 
      (clear ?block) 
      (ontable ?block) 
      (not (KBquery_fullHands ?robot))
    )
    :effect
      (and 
        (not (ontable ?block))
        (not (clear ?block))
        (holding ?robot ?block)
      )
  )

  (:action put-down
    :parameters (?robot - robot ?block - block)
    :precondition (holding ?robot ?block)
    :effect
      (and 
        (not (holding ?robot ?block))
        (clear ?block)
        (ontable ?block)
      )
  )

  (:action stack
    :parameters (?robot - robot ?block1 - block ?block2 - block)
    :precondition (and 
      (holding ?robot ?block1) 
      (clear ?block2)
      )
    :effect
      (and 
        (not (holding ?robot ?block1))
        (not (clear ?block2))
        (clear ?block1)
        (on ?block1 ?block2)
      )
  )

  (:action unstack
    :parameters (?robot - robot ?block1 - block ?block2 - block)
    :precondition (and 
      (on ?block1 ?block2) 
      (clear ?block1) 
      (not (KBquery_fullHands ?robot))
    )
    :effect
      (and 
        (holding ?robot ?block1)
        (clear ?block2)
        (not (clear ?block1))
        (not (on ?block2 ?block1))
      )
  )
)

; problem
(define (problem BLOCKS-5-0)
(:domain BLOCKS)
(:objects B E A C D - block pr2 - robot)
(:INIT (CLEAR D) (CLEAR C) (ONTABLE D) (ONTABLE A) (ON C E) (ON E B) (ON B A))
(:goal (AND (ON A E) (ON E B) (ON B D) (ON D C)))
)

; plan
1. (pick-up pr2 d)
   deleted: (ontable d) (clear d)
   added: (holding pr2 d)
   goals met: 1 of 4
2. (unstack pr2 c e)
   deleted: (clear c)
   added: (holding pr2 c) (clear e)
   goals met: 1 of 4
3. (put-down pr2 c)
   deleted: (holding pr2 c)
   added: (clear c) (ontable c)
   goals met: 1 of 4
4. (unstack pr2 e b)
   deleted: (clear e)
   added: (holding pr2 e) (clear b)
   goals met: 1 of 4
5. (stack pr2 d c)
   deleted: (holding pr2 d) (clear c)
   added: (clear d) (on d c)
   goals met: 2 of 4
6. (unstack pr2 b a)
   deleted: (clear b)
   added: (holding pr2 b) (clear a)
   goals met: 2 of 4
7. (stack pr2 b d)
   deleted: (holding pr2 b) (clear d)
   added: (clear b) (on b d)
   goals met: 3 of 4
8. (pick-up pr2 a)
   deleted: (ontable a) (clear a)
   added: (holding pr2 a)
   goals met: 3 of 4
9. (stack pr2 e b)
   deleted: (holding pr2 e) (clear b)
   added: (clear e)
   goals met: 3 of 4
10. (stack pr2 a e)
   deleted: (holding pr2 a) (clear e)
   added: (clear a) (on a e)
   goals met: 4 of 4
